{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"input_1","class_name":"InputLayer","config":{"batch_input_shape":[null,10],"dtype":"float32","sparse":false,"name":"input_1"},"inbound_nodes":[]},{"name":"dense_1","class_name":"Dense","config":{"units":80,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_1","trainable":true},"inbound_nodes":[[["input_1",0,0,{}]]]},{"name":"dropout_1","class_name":"Dropout","config":{"rate":0.7,"noise_shape":null,"seed":null,"name":"dropout_1","trainable":true},"inbound_nodes":[[["dense_1",0,0,{}]]]},{"name":"dropout_3","class_name":"Dropout","config":{"rate":0.7,"noise_shape":null,"seed":null,"name":"dropout_3","trainable":true},"inbound_nodes":[[["input_1",0,0,{}]]]},{"name":"dense_2","class_name":"Dense","config":{"units":5,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_2","trainable":true},"inbound_nodes":[[["dropout_1",0,0,{}]]]},{"name":"dense_3","class_name":"Dense","config":{"units":10,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_3","trainable":true},"inbound_nodes":[[["dropout_3",0,0,{}]]]},{"name":"dense","class_name":"Dense","config":{"units":20,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense","trainable":true},"inbound_nodes":[[["input_1",0,0,{}]]]},{"name":"dropout_2","class_name":"Dropout","config":{"rate":0.7,"noise_shape":null,"seed":null,"name":"dropout_2","trainable":true},"inbound_nodes":[[["dense_2",0,0,{}]]]},{"name":"dropout_4","class_name":"Dropout","config":{"rate":0.7,"noise_shape":null,"seed":null,"name":"dropout_4","trainable":true},"inbound_nodes":[[["dense_3",0,0,{}]]]},{"name":"dropout","class_name":"Dropout","config":{"rate":0.7,"noise_shape":null,"seed":null,"name":"dropout","trainable":true},"inbound_nodes":[[["dense",0,0,{}]]]},{"name":"concatenate","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate","trainable":true},"inbound_nodes":[[["dropout_2",0,0,{}],["dropout_4",0,0,{}],["dropout",0,0,{}]]]},{"name":"dense_4","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_4","trainable":true},"inbound_nodes":[[["concatenate",0,0,{}]]]}],"input_layers":[["input_1",0,0]],"output_layers":[["dense_1",0,0],["dense_2",0,0],["dense_3",0,0],["dense",0,0],["concatenate",0,0],["dense_4",0,0]]},"keras_version":"tfjs-layers 0.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["./model.weights.bin"],"weights":[{"name":"dense_1/kernel","shape":[10,80],"dtype":"float32"},{"name":"dense_1/bias","shape":[80],"dtype":"float32"},{"name":"dense_2/kernel","shape":[80,5],"dtype":"float32"},{"name":"dense_2/bias","shape":[5],"dtype":"float32"},{"name":"dense_3/kernel","shape":[10,10],"dtype":"float32"},{"name":"dense_3/bias","shape":[10],"dtype":"float32"},{"name":"dense/kernel","shape":[10,20],"dtype":"float32"},{"name":"dense/bias","shape":[20],"dtype":"float32"},{"name":"dense_4/kernel","shape":[35,1],"dtype":"float32"},{"name":"dense_4/bias","shape":[1],"dtype":"float32"}]}]}